Revit 2027 API
GeometryInstance.GetSymbolGeometryId Method
Gets the SymbolGeometryId that contains data about the symbol of this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SymbolGeometryId GetSymbolGeometryId()
Public Function GetSymbolGeometryId As SymbolGeometryId
public:
SymbolGeometryId^ GetSymbolGeometryId()
member GetSymbolGeometryId : unit -> SymbolGeometryId
Return Value
SymbolGeometryId
Returns the SymbolGeometryId that contains data about the symbol of this instance.
Remarks
Use the strings returned by SymbolGeometryId.AsIdentifier(bool) to check if two GeometryInstance point to the same geometry of the symbol.
See Also
Reference
GeometryInstance Class
Autodesk.Revit.DB Namespace